## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `aws_glue_catalog_database.bes_strategic_data_production`     |
|        | `aws_glue_catalog_database.bes_strategic_data_production_raw` |
|        | `aws_iam_policy.bes_strategic_data_access`                    |
| update | `aws_glue_trigger.bes_crm_salesforce`                         |
|        | `aws_s3_object.platform_gc_notify_requirements`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.bes_strategic_data_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "bes_strategic_data_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + version       = "2012-10-17"

      + statement {
          + actions   = [
              + "s3:GetBucketVersioning",
              + "s3:ListAllMyBuckets",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "S3ListBuckets"
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
              + "s3:ListBucketVersions",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-raw-production",
              + "arn:aws:s3:::cds-data-lake-transformed-production",
            ]
          + sid       = "S3ListObjects"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + null,
                  + "bes/",
                  + "bes/strategic-data/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:DeleteObject",
              + "s3:DeleteObjectVersion",
              + "s3:GetObject",
              + "s3:GetObjectAcl",
              + "s3:GetObjectTagging",
              + "s3:GetObjectVersion",
              + "s3:GetObjectVersionTagging",
              + "s3:ListBucketVersions",
              + "s3:ListMultipartUploadParts",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
              + "s3:PutObjectTagging",
              + "s3:PutObjectVersionAcl",
              + "s3:PutObjectVersionTagging",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-raw-production/bes/strategic-data/*",
              + "arn:aws:s3:::cds-data-lake-transformed-production/bes/strategic-data/*",
            ]
          + sid       = "S3ObjectsReadWrite"
        }
      + statement {
          + actions   = [
              + "athena:BatchGetQueryExecution",
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:GetWorkGroup",
              + "athena:ListQueryExecutions",
              + "athena:ListWorkGroups",
              + "athena:StartQueryExecution",
              + "athena:StopQueryExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:athena:ca-central-1:739275439843:workgroup/data-lake-production",
            ]
          + sid       = "AthenaAccess"
        }
      + statement {
          + actions   = [
              + "glue:GetColumnStatisticsTaskRuns",
              + "glue:GetDatabase",
              + "glue:GetDatabases",
              + "glue:GetPartitions",
              + "glue:GetTable",
              + "glue:GetTableVersion",
              + "glue:GetTableVersions",
              + "glue:GetTables",
              + "glue:SearchTables",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:glue:ca-central-1:739275439843:catalog",
              + "arn:aws:glue:ca-central-1:739275439843:database/bes_strategic_data_production",
              + "arn:aws:glue:ca-central-1:739275439843:database/bes_strategic_data_production_raw",
              + "arn:aws:glue:ca-central-1:739275439843:table/bes_strategic_data_production/*",
              + "arn:aws:glue:ca-central-1:739275439843:table/bes_strategic_data_production_raw/*",
            ]
          + sid       = "GlueTableReadAccess"
        }
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-athena-production",
              + "arn:aws:s3:::cds-data-lake-athena-production/*",
            ]
          + sid       = "AthenaResultsAccess"
        }
    }

  # aws_glue_catalog_database.bes_strategic_data_production will be created
  + resource "aws_glue_catalog_database" "bes_strategic_data_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /bes/strategic-data/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "bes_strategic_data_production"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.bes_strategic_data_production_raw will be created
  + resource "aws_glue_catalog_database" "bes_strategic_data_production_raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "RAW: data source path: /bes/strategic-data/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "bes_strategic_data_production_raw"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_trigger.bes_crm_salesforce will be updated in-place
  ~ resource "aws_glue_trigger" "bes_crm_salesforce" {
      ~ enabled       = true -> false
        id            = "BES / CRM / Salesforce"
        name          = "BES / CRM / Salesforce"
        tags          = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.bes_strategic_data_access will be created
  + resource "aws_iam_policy" "bes_strategic_data_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "bes-strategic-data-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # aws_s3_object.platform_gc_notify_requirements will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_notify_requirements" {
      ~ etag                          = "a6cf35ad25841f1de7909912c6b12b1c" -> "97c6acf284d09b01d99e40d74d724398"
        id                            = "platform/gc_notify/requirements.txt"
        tags                          = {}
      ~ version_id                    = "pU.4bWHDeVQAJUCBJ5cxRWPfkdY0FpIr" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + bes_crm_salesforce_name             = "BES / CRM / Salesforce"
  + platform_gc_forms_job_name          = "Platform / GC Forms"
  + platform_gc_notify_job_name         = "Platform / GC Notify"
  + platform_support_freshdesk_name     = "Platform / Support / Freshdesk"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_strategic_data_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
